src/cf/Catalogs/СостоянияЗаказНарядов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СостоянияЗаказНарядов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыОперацийЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаЗаказНаряд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыЗаказНарядов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыЗаказНарядов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостоянияВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостоянияЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеВыполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказНарядов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказНарядов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказНарядов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СостоянияЗаказНарядов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Если Не НачальноеЗаполнениеЭлементовВыполнено() Тогда
		
		Элемент = Элементы.Добавить();
		Элемент.Наименование = СостоянияЗаказов.СостояниеНеОбработан();
		Элемент.Цвет = Новый ХранилищеЗначения(Новый Цвет(0, 0, 0));
		
		Элемент = Элементы.Добавить();
		Элемент.Наименование = СостоянияЗаказов.СостояниеВРаботе();
		Элемент.Цвет = Новый ХранилищеЗначения(Новый Цвет(82, 163, 163));
		
		Элемент = Элементы.Добавить();
		Элемент.Наименование = СостоянияЗаказов.СостояниеВыставленСчет();
		Элемент.Цвет = Новый ХранилищеЗначения(Новый Цвет(88, 163, 88));
		
		Элемент = Элементы.Добавить();
		Элемент.Наименование = СостоянияЗаказов.СостояниеНаВыполнении();
		Элемент.Цвет = Новый ХранилищеЗначения(Новый Цвет(153, 135, 35));
		
	КонецЕсли;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Завершен";
	Элемент.Наименование = СостоянияЗаказов.СостояниеЗавершен();
	Элемент.Цвет = Новый ХранилищеЗначения(ЦветаСтиля.ПрошедшееСобытие);
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлемента
//
// Параметры:
//  Объект                  - СправочникОбъект.ВидыКонтактнойИнформации - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Объект.УстановитьНовыйКод();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Будет удалена в следующей версии.
//
Процедура ЗаполнитьПоставляемыеСостояния() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостоянияЗаказНарядов.Ссылка
		|ИЗ
		|	Справочник.СостоянияЗаказНарядов КАК СостоянияЗаказНарядов
		|ГДЕ
		|	СостоянияЗаказНарядов.Предопределенный = ЛОЖЬ";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		// 1. Состояние "В работе"
		Состояние = Справочники.СостоянияЗаказНарядов.СоздатьЭлемент();
		Состояние.Наименование	= НСтр("ru='В работе'");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Состояние);
		
		// 2. Состояние "Завершен"
		Состояние = Справочники.СостоянияЗаказНарядов.Завершен.ПолучитьОбъект();
		Состояние.Цвет = Новый ХранилищеЗначения(ЦветаСтиля.ПрошедшееСобытие);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Состояние);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось заполнить справочник ""Состояния заказ-нарядов"" по умолчанию по причине:
				|%1'"), 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.СостоянияЗаказНарядов, , ТекстСообщения);
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказНарядов") Тогда
		Параметры.Вставить("ВидЗаказа", Справочники.ВидыЗаказНарядов.Основной);
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	КоличествоЭлементов = 15;
	ДобавлятьПорядок = Истина;
	ИсключатьСостоянияЗаявок = Истина;
	
	Запрос.Текст = ТекстЗапросаПолученияДанныхВыбора(
	Параметры, Запрос, ДобавлятьПорядок, КоличествоЭлементов, ИсключатьСостоянияЗаявок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	НомерПоПорядку = 0;
	ЖирныйШрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина);
	
	Пока Выборка.Следующий() Цикл
		
		НомерПоПорядку = НомерПоПорядку + 1;
		Цвет = Выборка.Цвет.Получить();
		Если Цвет = Неопределено Тогда
			Цвет = ЦветаСтиля.ЦветТекстаПоля;
		КонецЕсли;
		
		КомпонентыФС = Новый Массив;
		Если ДобавлятьПорядок Тогда
			
			Если ИсключатьСостоянияЗаявок Тогда
				НомерСостояния = Выборка.НомерСтроки;
			Иначе
				НомерСостояния = НомерПоПорядку;
			КонецЕсли;
			
			КомпонентыФС.Добавить(Строка(НомерСостояния) + ". ");
			
		КонецЕсли;
		
		Если Выборка.Состояние = Завершен Тогда
			Шрифт = ЖирныйШрифт;
		КонецЕсли;
		
		КомпонентыФС.Добавить(Новый ФорматированнаяСтрока(Выборка.Наименование, Шрифт, Цвет));
		
		ПредставлениеСостояния = Новый ФорматированнаяСтрока(КомпонентыФС);
		ДанныеВыбора.Добавить(Выборка.Состояние, ПредставлениеСостояния);
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.Свойство("РежимВыбора") И Параметры.РежимВыбора
			И Параметры.Свойство("ВидЗаказа") И ЗначениеЗаполнено(Параметры.ВидЗаказа) Тогда
				ВыбраннаяФорма = "Справочник.ВидыЗаказНарядов.Форма.ФормаСпискаЭтапов";
	Иначе
		ВыбраннаяФорма = "Справочник.СостоянияЗаказНарядов.Форма.ФормаСписка";
	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПолученияДанныхВыбора(
	Параметры, Запрос, ДобавлятьПорядок, КоличествоЭлементов, ИсключатьСостоянияЗаявок)
	
	ОтображатьСостоянияЗаявок = Параметры.Свойство("ОтображатьСостоянияЗаявок");
	
	Если Параметры.Свойство("АвтоПодбор") И Параметры.АвтоПодбор = Истина Тогда 
		
		ИсключатьСостоянияЗаявок = Не ОтображатьСостоянияЗаявок
		И РаботаСЗаявками.ЗаявкиИспользуются(, Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд);
		
		Если ИсключатьСостоянияЗаявок Тогда
			
			Результат = 
				"ВЫБРАТЬ
				|	ВидыЗаказНарядовПорядокСостояний.Состояние КАК Состояние,
				|	МАКСИМУМ(ВидыЗаказНарядовПорядокСостояний.НомерСтроки <= ВидыЗаказНарядов.НомерСостоянияЗаявки) КАК ЭтоСостояниеЗаявки
				|ПОМЕСТИТЬ втСостоянияЗаказов
				|ИЗ
				|	Справочник.ВидыЗаказНарядов.ПорядокСостояний КАК ВидыЗаказНарядовПорядокСостояний
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗаказНарядов КАК ВидыЗаказНарядов
				|		ПО ВидыЗаказНарядовПорядокСостояний.Ссылка = ВидыЗаказНарядов.Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ВидыЗаказНарядовПорядокСостояний.Состояние
				|
				|ИМЕЮЩИЕ
				|	МАКСИМУМ(ВидыЗаказНарядовПорядокСостояний.НомерСтроки <= ВидыЗаказНарядов.НомерСостоянияЗаявки) = ЛОЖЬ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ ПЕРВЫЕ 15
				|	СостоянияЗаказНарядов.Ссылка КАК Состояние,
				|	СостоянияЗаказНарядов.Наименование КАК Наименование,
				|	СостоянияЗаказНарядов.Цвет КАК Цвет
				|ИЗ
				|	Справочник.СостоянияЗаказНарядов КАК СостоянияЗаказНарядов
				|ГДЕ
				|	СостоянияЗаказНарядов.Наименование ПОДОБНО &Наименование
				|	И НЕ СостоянияЗаказНарядов.Ссылка = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказНарядов.Завершен)
				|	И СостоянияЗаказНарядов.Ссылка В
				|			(ВЫБРАТЬ
				|				втДоступныеСостоянияЗаказов.Состояние КАК Состояние
				|			ИЗ
				|				втДоступныеСостоянияЗаказов КАК втДоступныеСостоянияЗаказов)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование";
			
		Иначе
			
			Результат = 
				"ВЫБРАТЬ ПЕРВЫЕ 15
				|	СостоянияЗаказНарядов.Ссылка КАК Состояние,
				|	СостоянияЗаказНарядов.Наименование КАК Наименование,
				|	СостоянияЗаказНарядов.Цвет КАК Цвет
				|ИЗ
				|	Справочник.СостоянияЗаказНарядов КАК СостоянияЗаказНарядов
				|ГДЕ
				|	СостоянияЗаказНарядов.Наименование ПОДОБНО &Наименование
				|	И НЕ СостоянияЗаказНарядов.Ссылка = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказНарядов.Завершен)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование";
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Наименование", "%" + Параметры.СтрокаПоиска + "%");
		ДобавлятьПорядок = Ложь;
		
	ИначеЕсли Параметры.Свойство("ВидЗаказа") И ЗначениеЗаполнено(Параметры.ВидЗаказа) Тогда
		
		ИсключатьСостоянияЗаявок = Не ОтображатьСостоянияЗаявок
		И РаботаСЗаявками.ЗаявкиИспользуются(Параметры.ВидЗаказа);
		
		Если ИсключатьСостоянияЗаявок Тогда
			
			Результат = 
				"ВЫБРАТЬ ПЕРВЫЕ 15
				|	ВидыЗаказНарядовПорядокСостояний.Состояние КАК Состояние,
				|	ВидыЗаказНарядовПорядокСостояний.Состояние.Наименование КАК Наименование,
				|	ВидыЗаказНарядовПорядокСостояний.Состояние.Цвет КАК Цвет,
				|	ВидыЗаказНарядовПорядокСостояний.НомерСтроки КАК НомерСтроки
				|ИЗ
				|	Справочник.ВидыЗаказНарядов.ПорядокСостояний КАК ВидыЗаказНарядовПорядокСостояний
				|ГДЕ
				|	ВидыЗаказНарядовПорядокСостояний.Ссылка = &ВидЗаказа
				|	И ВидыЗаказНарядовПорядокСостояний.Состояние.ПометкаУдаления = ЛОЖЬ
				|	И ВидыЗаказНарядовПорядокСостояний.НомерСтроки > ВидыЗаказНарядовПорядокСостояний.Ссылка.НомерСостоянияЗаявки
				|
				|УПОРЯДОЧИТЬ ПО
				|	ВидыЗаказНарядовПорядокСостояний.НомерСтроки";
			
		Иначе
			
			Результат = 
				"ВЫБРАТЬ ПЕРВЫЕ 15
				|	ВидыЗаказНарядовПорядокСостояний.Состояние КАК Состояние,
				|	ВидыЗаказНарядовПорядокСостояний.Состояние.Наименование КАК Наименование,
				|	ВидыЗаказНарядовПорядокСостояний.Состояние.Цвет КАК Цвет
				|ИЗ
				|	Справочник.ВидыЗаказНарядов.ПорядокСостояний КАК ВидыЗаказНарядовПорядокСостояний
				|ГДЕ
				|	ВидыЗаказНарядовПорядокСостояний.Ссылка = &ВидЗаказа
				|	И ВидыЗаказНарядовПорядокСостояний.Состояние.ПометкаУдаления = ЛОЖЬ
				|
				|УПОРЯДОЧИТЬ ПО
				|	ВидыЗаказНарядовПорядокСостояний.НомерСтроки";
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ВидЗаказа", Параметры.ВидЗаказа);
		
	Иначе
		
		ИсключатьСостоянияЗаявок = Не ОтображатьСостоянияЗаявок
		И РаботаСЗаявками.ЗаявкиИспользуются(, Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд);
		
		Если ИсключатьСостоянияЗаявок Тогда
			
			Результат = 
				"ВЫБРАТЬ
				|	ВидыЗаказНарядовПорядокСостояний.Состояние КАК Состояние,
				|	МАКСИМУМ(ВидыЗаказНарядовПорядокСостояний.НомерСтроки <= ВидыЗаказНарядов.НомерСостоянияЗаявки) КАК ЭтоСостояниеЗаявки
				|ПОМЕСТИТЬ втСостоянияЗаказов
				|ИЗ
				|	Справочник.ВидыЗаказНарядов.ПорядокСостояний КАК ВидыЗаказНарядовПорядокСостояний
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗаказНарядов КАК ВидыЗаказНарядов
				|		ПО ВидыЗаказНарядовПорядокСостояний.Ссылка = ВидыЗаказНарядов.Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ВидыЗаказНарядовПорядокСостояний.Состояние
				|
				|ИМЕЮЩИЕ
				|	МАКСИМУМ(ВидыЗаказНарядовПорядокСостояний.НомерСтроки <= ВидыЗаказНарядов.НомерСостоянияЗаявки) = ЛОЖЬ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ ПЕРВЫЕ 15
				|	СостоянияЗаказНарядов.Ссылка КАК Состояние,
				|	СостоянияЗаказНарядов.Наименование КАК Наименование,
				|	СостоянияЗаказНарядов.Цвет КАК Цвет
				|ИЗ
				|	Справочник.СостоянияЗаказНарядов КАК СостоянияЗаказНарядов
				|ГДЕ
				|	СостоянияЗаказНарядов.Ссылка В
				|			(ВЫБРАТЬ
				|				втДоступныеСостоянияЗаказов.Состояние КАК Состояние
				|			ИЗ
				|				втДоступныеСостоянияЗаказов КАК втДоступныеСостоянияЗаказов)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование";
			
		Иначе
			
			Результат = 
				"ВЫБРАТЬ ПЕРВЫЕ 15
				|	СостоянияЗаказНарядов.Ссылка КАК Состояние,
				|	СостоянияЗаказНарядов.Наименование КАК Наименование,
				|	СостоянияЗаказНарядов.Цвет КАК Цвет
				|ИЗ
				|	Справочник.СостоянияЗаказНарядов КАК СостоянияЗаказНарядов
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование";
			
		КонецЕсли;
		
		ДобавлятьПорядок = Ложь;
		
	КонецЕсли;
	
	Возврат СтрЗаменить(Результат, "15", КоличествоЭлементов);
	
КонецФункции

Функция НачальноеЗаполнениеЭлементовВыполнено()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияЗаказНарядов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СостоянияЗаказНарядов КАК СостоянияЗаказНарядов
	|ГДЕ
	|	СостоянияЗаказНарядов.Предопределенный = ЛОЖЬ";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
